# Напишите программу, которая решает квадратные уравнения
# даже если дискриминант отрицательный.
# Используйте комплексные числа для извлечения квадратного корня.


a = 1
b = -2
c = 20

d = b**2 - 4*a*c

if d > 0:
    x1 = (-b + d**0.5)/(2*a)
    x2 = (-b - d**0.5)/(2*a)
    print(x1 , x2, sep='\n')
elif d == 0:
    x = (-b/2)*a
    print(x)
elif d < 0:
    x1 = (-b + d**0.5)/(2*a)
    x2 = (-b - d**0.5)/(2*a)
    print(x1 , x2, sep='\n')