# Создайте пакет с всеми модулями, которые вы создали за
# время занятия.
# Добавьте в __init__ пакета имена модулей внутри дандер
# __all__.
# В модулях создайте дандер __all__ и укажите только те
# функции, которые могут верно работать за пределами
# модуля.

from Task_8 import Task_7


# print(Task_7.valid_year(1996))
print(Task_7.parse_data('10.05.1994'))